export interface TermItem {
  id: number;
  question: string;
  answer: string;
}

export const termsData: TermItem[] = [
  {
    id: 1,
    question: '1. لمن هذا الطلب؟',
    answer:
      'باستخدامك لهذا التطبيق، فإنك توافق على تقديم معلومات صحيحة، واستخدام المنصة لأغراض التبرع بالدم وطلبه فقط. تلتزم المنصة بحماية بياناتك الشخصية وعدم مشاركتها إلا عند الضرورة. تحتفظ إدارة التطبيق بحق تعديل الخدمات أو تعليق الحسابات المخالفة للشروط. بإنشاء حساب، فإنك توافق على هذه الشروط والأحكام.',
  },
  {
    id: 2,
    question: '2. كيف يمكنني التسجيل؟',
    answer:
      'يمكنك التسجيل من خلال زيارة صفحة التسجيل وإدخال المعلومات المطلوبة مثل الاسم، البريد الإلكتروني، ورقم الهاتف. بعد ذلك، ستتلقى رابط تأكيد عبر البريد الإلكتروني لتفعيل حسابك.',
  },
  {
    id: 3,
    question: '3. ما هي متطلبات التبرع بالدم؟',
    answer:
      'يجب أن تكون في سن الـ 18 أو أكبر، وأن يكون لديك وزن مناسب، وصحة جيدة. يجب أيضاً أن لا تكون قد تبرعت بالدم خلال الثلاثين يومًا الماضية.',
  },
  {
    id: 4,
    question: '4. كيف يتم استخدام بياناتي؟',
    answer:
      'تُستخدم بياناتك فقط لتسهيل عمليات التبرع ومتابعة الطلبات. نلتزم بعدم مشاركة معلوماتك مع أي جهة خارجية دون إذن.',
  },
  {
    id: 5,
    question: '5. ماذا أفعل إذا واجهت مشكلة؟',
    answer:
      'إذا واجهت أي مشكلة، يمكنك التواصل مع فريق الدعم الخاص بنا عبر التطبيق أو البريد الإلكتروني، وسنكون سعداء بمساعدتك في حلها.',
  },
];
